# ক্রোম এক্সটেনশনের জন্য লোক্যালাইজেশন ফাইল
# URL: https://chrome.google.com/webstore/detail/xtranslate/gfgpkepllngchpmcippidfhmbhlljhoo
-app-brand-name = XTranslate

# সাধারণ
short_description = ওয়েব পেজে টেক্সট সহজে অনুবাদ করুন
description = পৃষ্ঠার প্রসঙ্গে টেক্সট অনুবাদ করুন, আপনার পপআপ ব্লকের শৈলী কাস্টমাইজ করুন এবং আরও অনেক কিছু।

# শিরোনাম
open_in_window = বাহ্যিক উইন্ডোতে খুলুন
tab_settings = সেটিংস
tab_theme = পপআপ
tab_text_input = অনুবাদ করুন
tab_history = ইতিহাস

# সেটিংস
setting_title_common = সাধারণ
setting_title_text_input = অনুবাদ করুন
setting_title_popup = পপআপ
setting_title_translator_service = সেবা
settings_title_tts = টেক্সট-টু-স্পীচ
settings_title_appearance = উপস্থিতি
auto_play_tts = স্বয়ংক্রিয়ভাবে টেক্সট-টু-স্পীচ চালান
use_chrome_tts = সিস্টেমের টেক্সট-টু-স্পীচ ইঞ্জিন ব্যবহার করতে বাধ্য করুন
use_chrome_tts_tooltip_info = যখন অনুবাদকের নিজস্ব TTS ইঞ্জিন নেই তখন এই বিকল্প স্বয়ংক্রিয়ভাবে সক্রিয় হয়
use_dark_theme = এই উইন্ডোটির জন্য ডার্ক থিমে সুইচ করুন
tts_default_system_voice = ডিফল্ট সিস্টেম ভয়েস
tts_select_voice_title = ভয়েস নির্বাচন করুন
tts_play_demo_sound = ডেমো শব্দ বাজান
tts_play_demo_sound_edit = ভয়েস ডেমোর জন্য টেক্সট সম্পাদনা করুন
import_export_settings = সেটিংস আয়াত বা রপ্তানি করুন
export_settings_button_label = সেটিংস রপ্তানি করুন
import_settings_button_label = সেটিংস আয়াত করুন
import_incorrect_file_format = ভুল ফাইল ফরমেট (সম্ভবত { $fileNameJson } হওয়া উচিত)
imported_setting_successful = কী { $key } এর অধীনে সেটিংস সফলভাবে আয়াত করা হয়েছে
display_icon_near_selection = নির্বাচিত টেক্সটের কাছে আইকন দেখান
show_tts_icon_inside_popup = টেক্সট-টু-স্পীচ আইকন দেখান
show_select_provider_icon_in_popup = পরবর্তী অনুবাদ আইকন দেখান
show_copy_translation_icon = অনুবাদ কপি করার আইকন দেখান
show_save_as_favorite_icon = ফেভারিটে সংরক্ষণ করার আইকন দেখান
show_close_popup_button = ডান কোণায় পপআপ বন্ধ করার বাটন দেখান
show_detected_language_block = শনাক্তকৃত ভাষা দেখান
display_on_click_by_selected_text = নির্বাচনে ক্লিক করলে দেখান
display_popup_after_text_selected = টেক্সট নির্বাচন করার পর দেখান
display_popup_on_double_click = একটি শব্দে ডাবল ক্লিক করলে দেখান
display_popup_on_hotkey = যখন আমি শর্টকাট চাবি চাপাই তখন দেখান
remember_last_typed_text = সর্বশেষ লিখিত টেক্সট মনে রাখুন
sub_header_quick_access_hotkey = গ্লোবাল শর্টকাট সেট করুন
quick_access_configure_link = এই উইন্ডোটির দ্রুত অ্যাক্সেসের জন্য কি-বোর্ড শর্টকাট কনফিগার করুন
swap_languages = ভাষা স্থানান্তর করুন
popup_position_title = অবস্থান
popup_position_auto = অটো (টেক্সটের সাথে সারিবদ্ধ)
popup_position_left_top = বাম উপরের কোণা
popup_position_right_top = ডান উপরের কোণা
popup_position_left_bottom = বাম নিচের কোণা
popup_position_right_bottom = ডান নিচের কোণা
translation_delay = অনুবাদের দেরি
translation_delay_info = যদি আপনি প্রায়শই গুগল বা অন্যান্য সেবা থেকে ব্লকিং (503 এরর) অভিজ্ঞ হয়ে থাকেন তাহলে বড় দেরি মান সেট করুন
reverse_translate_select_placeholder = উল্টো অনুবাদ ভাষা
reverse_translate_add_action = উল্টো ভাষা যোগ করুন: { $lang } -> ? (শুধু "অটো-ডিটেক্ট" বিকল্প সাথে প্রযোজ্য)
reverse_translate_delete_action = উল্টো অনুবাদ ভাষা সরান
skip_translation_vendor_in_rotation = রোটেশনে { $vendor }-অনুবাদগুলি এড়িয়ে যান তির-আইকন বা কীবোর্ড তিরের মাধ্যমে (পপআপে)
custom_font_select = কাস্টম ফন্ট নির্বাচন করুন

# থিম
popup_play_icon_title = শোনুন
popup_copy_translation_title = অনুবাদ কপি করুন
popup_next_vendor_icon_title = { $translator } দিয়ে অনুবাদ করুন
popup_demo_translation = অনুবাদিত টেক্সট
popup_demo_dictionary_noun = বিশেষ্য
popup_demo_dictionary_values = শব্দ ১, শব্দ ২, ইত্যাদি।
sub_header_background = পটভূমি
sub_header_box_shadow = বক্সের ছায়া
sub_header_text = টেক্সট
sub_header_border = সীমানা
sub_header_box_size = বক্সের আকার
background_color = রং
background_linear_gradient = লিনিয়ার
box_shadow_color = রং
box_shadow_inner = ভিতরে
text_size = আকার
text_font_family = ফন্ট
text_color = রং
text_shadow = ছায়া
text_shadow_size = ব্লার রেডিয়াস
text_shadow_offset_x = অনুভূমিক অবস্থান
text_shadow_offset_y = উলম্ব অবস্থান
text_shadow_color = রং
border_width = প্রস্থ
border_style = শৈলী
border_color = রং
border_radius = ব্যাসার্ধ
box_size_min_width = সর্বনিম্ন প্রস্থ
box_size_min_height = সর্বনিম্ন উচ্চতা
box_size_max_width = সর্বোচ্চ প্রস্থ
box_size_max_height = সর্বোচ্চ উচ্চতা
reset_to_default_button_text = ডিফল্টে রিসেট করুন

# টেক্সট ইনপুট
text_field_placeholder = অনুবাদ পেতে এখানে টাইপিং শুরু করুন
translated_with = { $translator } দিয়ে অনুবাদ করা হয়েছে ({ $lang })
translated_from = অনুবাদ করা হয়েছে: { $lang } থেকে
translate_also_from = এই থেকেও অনুবাদ করুন
spell_correction = আপনি কি { $suggestion } বলতে চেয়েছেন?
text_input_translation_hint = তৎক্ষণাৎ অনুবাদের জন্য { $hotkey }, দেরি: { $timeout }ms

# ইতিহাস
history_enabled_flag = সক্রিয়
history_settings_save_words_only = শুধুমাত্র অভিধানের শব্দ সংরক্ষণ করুন
history_search_input_placeholder = ইতিহাসে খুঁজুন
history_clear_period_hour = সর্বশেষ ঘণ্টা
history_clear_period_day = সর্বশেষ দিন
history_clear_period_month = সর্বশেষ মাস
history_clear_period_year = সর্বশেষ বছর
history_clear_period_all = সব
history_button_clear = ইতিহাস মুছে ফেলুন
history_button_show_more = আরো দেখান
history_export_entries = { $format } রপ্তানি করুন
history_import_entries = { $format } আয়াত করুন
history_page_size = পৃষ্ঠার আকার
history_icon_tooltip_search = খুঁজুন
history_icon_tooltip_imp_exp = আয়াত / রপ্তানি
history_icon_tooltip_settings = সেটিংস
history_show_favorites_only = শুধুমাত্র ফেভারিট দেখান
history_mark_as_favorite = আইটেমকে ফেভারিট হিসেবে চিহ্নিত করুন
history_unmark_as_favorite = আইটেমকে ফেভারিট থেকে অচিহ্নিত করুন
history_import_success = { $itemsCount } ইতিহাস এন্ট্রি সফলভাবে আয়াত করা হয়েছে
history_import_file_error = '{ $fileName }' ফাইল পড়তে সমস্যা: { $errorInfo }

# কন্টেক্স্ট মেনু
context_menu_translate_full_page = { $lang }-এ অনুবাদ করুন
context_menu_translate_selection = { $translator } দিয়ে { $selection } অনুবাদ করুন

# অন্যান্য
share_with_friends = যদি আপনি অ্যাপটি পছন্দ করেন তাহলে আপনার বন্ধুদের সাথে শেয়ার করুন
translation_data_failed = ডেটা লোড ব্যর্থ
rate_app_info1 = আপনি কি অ্যাপটি ব্যবহার করে আনন্দ করছেন? দয়া করে আমাদের ৫ স্টার রেটিং দিন!
rate_app_info2 = এটি অন্যান্য ব্যবহারকারীদের এক্সটেনশন খুঁজে বের করতে এবং এর সুবিধাগুলি ছড়িয়ে দিতে সাহায্য করবে।
rate_app_button = এক্সটেনশন স্টোরে রেট করুন
rate_app_button_later = পরে আমাকে মনে করিয়ে দিন
deepl_get_own_key_info = www.deepl.com-তে নিবন্ধন করুন এবং DeepL API-এর জন্য আপনার নিজস্ব ফ্রি অথেন্টিকেশন কী পান
deepl_insert_auth_key = DeepL অনুবাদে প্রবেশাধিকার পেতে অথেন্টিকেশন API কী সেট করুন
deepl_insert_auth_key_warning = সতর্কতা: এই এক্সটেনশন উইন্ডো ছাড়া অন্য কোথাও আপনার API কী না দিন
deepl_insert_auth_key_remove = DeepL API কী সরান
target_lang_placeholder = লক্ষ্য ভাষা
source_lang_placeholder = উৎস ভাষা
favorites_lang_title = ফেভারিট
favorites_info_tooltip = ভাষাকে ফেভারিট হিসেবে চিহ্নিত/অচিহ্নিত করতে (তালিকা শীর্ষে দেখানো হয়), { $hotkey } + ক্লিক করুন
donate_title = ডেভেলপর সাপোর্ট
donate_copy_wallet = ঠিকানা কপি করুন
donate_description = আপনি যদি অ্যাপটি পছন্দ করেন তাহলে ডেভেলপারদের দান করুন। ধন্যবাদ!
service_unavailable = সেবা উপলব্ধ নেই। ৫-২৫ মিনিট পরে আবার চেষ্টা করুন। যদি এটি স্থায়ীভাবে ঘটে তাহলে সেটিংসে অনুবাদের দেরি বাড়ান।
service_confirm_not_a_robot = আপনি { $link }-এ যেতে পারেন এবং নিশ্চিত করতে পারেন যে আপনি রোবট নন।

# গোপনীয়তা নীতি
privacy_policy_title_updated = গোপনীয়তা নীতি আপডেট করা হয়েছে
privacy_policy_accept_terms = শর্তাবলী এবং নিয়মাবলী গ্রহণ করুন

# মেলোটেল ইন্টিগ্রেশন
mellowtel_greetings = নমস্কার, বন্ধু 👋
mellowtel_text1 = আপনি যেমন জানতে পারেন, এই এক্সটেনশনটি সবার জন্য মুফত এবং উপলব্ধ... কিন্তু এইবার এটি চলতে রাখতে আমাদের আপনার কিছু কাজের প্রয়োজন!
mellowtel_text2 = এই নতুন সংস্করণে { $link } ওপেন-সোর্স লাইব্রেরি অন্তর্ভুক্ত রয়েছে। এই লাইব্রেরি আপনাকে আপনার ব্যবহৃত ইন্টারনেটকে বিশ্বস্ত AI ল্যাব এবং স্টার্টআপের সাথে ভাগ করে নিতে দেয় যারা তাদের মডেল প্রশিক্ষণের জন্য এটি ব্যবহার করে।
mellowtel_usage_title = আমরা মেলোটেল ব্যবহার করি:
mellowtel_usage1 = সেবার আউটেজ ট্র্যাক করার জন্য
mellowtel_usage2 = সেবার গুণমান মাপতে
mellowtel_usage3 = এই এক্সটেনশনের ডেভেলপার হিসেবে আমরা আয়ের একটি ছোট অংশ পাই
mellowtel_accept_all_info1 = আপনি যদি 'সব গ্রহণ করুন' বেছে নেন, তাহলে আমরা মেলোটেল API ব্যবহার করবো: বিশ্বস্ত পার্টনারদের আপনার নেটওয়ার্ক নোডের মাধ্যমে তাদের ট্রাফিকের অংশ রাউট করে ইন্টারনেট রিসোর্সে অ্যাক্সেস করার সুযোগ দিতে
mellowtel_accept_all_info2 = মেলোটেল শুধুমাত্র আপনার ব্যান্ডউইথ ভাগ করে নেয়। নিরাপত্তা এবং গোপনীয়তা ১০০% নিশ্চিত এবং লাইব্রেরি সবাই দেখতে পারে এমন ওপেন-সোর্স।
mellowtel_regulation1 = এটি ব্যক্তিগত তথ্য সংগ্রহ করে, ভাগ করে না বা বিক্রি করে না (যতক্ষণ না অজ্ঞাত তথ্যও)।
mellowtel_regulation2 = এটি খুব বেশি নিয়ন্ত্রিত: মেলোটেল Chrome Web Store নিয়ন্ত্রকদের সাথে যোগাযোগ বজায় রাখে নিরাপদ অভিজ্ঞতা নিশ্চিত করার জন্য।
mellowtel_regulation3 = এটি CWS নিয়ন্ত্রকদের মান্যতা পরীক্ষা এবং প্রয়োগের জন্য সরঞ্জাম প্রদান করে।
mellowtel_button_decline = ঐচ্ছিক ব্যবহার প্রত্যাখ্যান করুন
mellowtel_button_accept = সব গ্রহণ করুন
mellowtel_dialog_footer = পড়তে সময় নেওয়ার জন্য ধন্যবাদ, { $devs } দল।

# বিভিন্ন ত্রুটি বার্তা
error_403_auth_failed = অথেন্টিকেশন ব্যর্থ। দয়া করে সেটিংসে একটি বৈধ অথেন্টিকেশন API কী প্রদান করুন।

# ওপেন-এআই ইন্টিগ্রেশন
ai_choose_model = AI মডেল বেছে নিন
ai_choose_model_cost_effective = সবচেয়ে কস্ট-কার্যকর
ai_choose_model_recommended = সুপারিশকৃত মডেল
ai_choose_model_best_results = সর্বোত্তম ফলাফল (সবচেয়ে মহঙ্গ)

# pdf.js-এর মাধ্যমে PDF অনুবাদ সমর্থন
pdf_use_custom_viewer = PDF ফাইলে অনুবাদ সমর্থন করুন
pdf_use_custom_viewer_info = এই বিকল্পটি ডিফল্ট PDF ভিউয়ারকে প্রতিস্থাপন করবে
