# क्रोम एक्सटेंशन के लिए लोकलाइज़ेशन फ़ाइल
# URL: https://chrome.google.com/webstore/detail/xtranslate/gfgpkepllngchpmcippidfhmbhlljhoo
-app-brand-name = XTranslate

# सामान्य
short_description = वेब पेजों पर टेक्स्ट का आसानी से अनुवाद करें
description = पेज के संदर्भ में टेक्स्ट का अनुवाद करें, अपने पॉप-अप ब्लॉक की शैली को कस्टमाइज़ करें, और बहुत कुछ।

# हेडर
open_in_window = बाहरी विंडो में खोलें
tab_settings = सेटिंग्स
tab_theme = पॉप-अप
tab_text_input = अनुवाद करें
tab_history = इतिहास

# सेटिंग्स
setting_title_common = सामान्य
setting_title_text_input = अनुवाद
setting_title_popup = पॉप-अप
setting_title_translator_service = सेवा
settings_title_tts = टेक्स्ट-टू-स्पीच
settings_title_appearance = उपस्थिति
auto_play_tts = ऑटो-प्ले टेक्स्ट-टू-स्पीच
use_chrome_tts = सिस्टम टेक्स्ट-टू-स्पीच इंजन का उपयोग करने के लिए मजबूर करें
use_chrome_tts_tooltip_info = जब अनुवादक के पास अपना स्वयं का TTS इंजन नहीं होता है तब यह विकल्प स्वतः सक्रिय हो जाता है
use_dark_theme = इस विंडो के लिए डार्क थीम पर स्विच करें
tts_default_system_voice = डिफ़ॉल्ट सिस्टम वॉइस
tts_select_voice_title = वॉइस चुनें
tts_play_demo_sound = डेमो ध्वनि बजाएं
tts_play_demo_sound_edit = वॉइस डेमो के लिए टेक्स्ट संपादित करें
import_export_settings = सेटिंग्स आयात या निर्यात करें
export_settings_button_label = सेटिंग्स निर्यात करें
import_settings_button_label = सेटिंग्स आयात करें
import_incorrect_file_format = असही फाइल फॉर्मेट (शायद { $fileNameJson } होना चाहिए था)
imported_setting_successful = कुंजी { $key } के तहत सेटिंग्स सफलतापूर्वक आयात की गईं
display_icon_near_selection = चयनित टेक्स्ट के पास आइकन दिखाएं
show_tts_icon_inside_popup = टेक्स्ट-टू-स्पीच आइकन दिखाएं
show_next_vendor_icon_in_popup = अगला-अनुवाद आइकन दिखाएं
show_copy_translation_icon = अनुवाद कॉपी करने का आइकन दिखाएं
show_save_as_favorite_icon = पसंदीदा में सहेजने का आइकन दिखाएं
show_close_popup_button = दाहिने कोने में पॉप-अप बंद करने का बटन दिखाएं
show_detected_language_block = पहचानी गई भाषा दिखाएं
display_on_click_by_selected_text = चयन पर क्लिक करने पर दिखाएं
display_popup_after_text_selected = टेक्स्ट चयनित होने के बाद दिखाएं
display_popup_on_double_click = शब्द पर डबल-क्लिक करने पर दिखाएं
display_popup_on_hotkey = जब मैं हॉटकी दबाऊं तब दिखाएं
remember_last_typed_text = आखिरी टाइप किया गया टेक्स्ट याद रखें
sub_header_quick_access_hotkey = ग्लोबल हॉटकी सेट करें
quick_access_configure_link = इस विंडो को तेजी से एक्सेस करने के लिए कीबोर्ड शॉर्टकट कॉन्फ़िगर करें
swap_languages = भाषाएँ बदलें
popup_position_title = स्थान
popup_position_auto = ऑटो (टेक्स्ट के अनुसार संरेखित)
popup_position_left_top = बाएं-ऊपरी कोना
popup_position_right_top = दाएं-ऊपरी कोना
popup_position_left_bottom = बाएं-नीचे कोना
popup_position_right_bottom = दाएं-नीचे कोना
translation_delay = अनुवाद में देरी
translation_delay_info = यदि आप अक्सर Google या अन्य सेवाओं से ब्लॉकिंग (503 एरर) का अनुभव करते हैं तो देरी का मान बढ़ाएँ
reverse_translate_select_placeholder = विपरीत अनुवाद भाषा
reverse_translate_add_action = विपरीत भाषा जोड़ें: { $lang } -> ? (केवल "ऑटो-डिटेक्ट" विकल्प के साथ लागू होता है)
reverse_translate_delete_action = विपरीत अनुवाद भाषा हटाएं
skip_translation_vendor_in_rotation = रोटेशन में { $vendor }-अनुवादों को छोड़ें, तीर-आइकन या कीबोर्ड के तीरों के माध्यम से (पॉप-अप में)
custom_font_select = कस्टम फॉन्ट चुनें

# थीम
popup_play_icon_title = सुनें
popup_copy_translation_title = अनुवाद कॉपी करें
popup_next_vendor_icon_title = { $translator } के साथ अनुवाद करें
popup_demo_translation = अनुवादित टेक्स्ट
popup_demo_dictionary_noun = संज्ञा
popup_demo_dictionary_values = शब्द 1, शब्द 2, आदि।
sub_header_background = पृष्ठभूमि
sub_header_box_shadow = बॉक्स छाया
sub_header_text = टेक्स्ट
sub_header_border = सीमा
sub_header_box_size = बॉक्स आकार
background_color = रंग
background_linear_gradient = रेखीय
box_shadow_color = रंग
box_shadow_inner = अंदर
text_size = आकार
text_font_family = फॉन्ट
text_color = रंग
text_shadow = छाया
text_shadow_size = ब्लर रेडियस
text_shadow_offset_x = क्षैतिज ऑफ़सेट
text_shadow_offset_y = ऊर्ध्वाधर ऑफ़सेट
text_shadow_color = रंग
border_width = चौड़ाई
border_style = शैली
border_color = रंग
border_radius = रेडियस
box_size_min_width = न्यूनतम चौड़ाई
box_size_min_height = न्यूनतम ऊंचाई
box_size_max_width = अधिकतम चौड़ाई
box_size_max_height = अधिकतम ऊंचाई
reset_to_default_button_text = डिफ़ॉल्ट पर रीसेट करें

# टेक्स्ट इनपुट
text_field_placeholder = यहाँ अनुवाद पाने के लिए टाइपिंग शुरू करें
translated_with = { $translator } ({ $lang }) के साथ अनुवादित
translated_from = अनुवादित से: { $lang }
translate_also_from = इससे भी अनुवाद करें
spell_correction = क्या आपका मतलब { $suggestion } है?
text_input_translation_hint = तुरंत अनुवाद करने के लिए { $hotkey }, देरी: { $timeout }ms

# इतिहास
history_enabled_flag = सक्रिय
history_settings_save_words_only = केवल शब्दकोश के शब्द सहेजें
history_search_input_placeholder = इतिहास में खोजें
history_clear_period_hour = पिछला घंटा
history_clear_period_day = पिछला दिन
history_clear_period_month = पिछला महीना
history_clear_period_year = पिछला वर्ष
history_clear_period_all = सभी
history_button_clear = इतिहास साफ़ करें
history_button_show_more = अधिक दिखाएं
history_export_entries = { $format } निर्यात करें
history_import_entries = { $format } आयात करें
history_page_size = पेज आकार
history_icon_tooltip_search = खोज
history_icon_tooltip_imp_exp = आयात / निर्यात
history_icon_tooltip_settings = सेटिंग्स
history_show_favorites_only = केवल पसंदीदा दिखाएं
history_mark_as_favorite = आइटम को पसंदीदा के रूप में चिह्नित करें
history_unmark_as_favorite = आइटम को पसंदीदा से अचिह्नित करें
history_import_success = { $itemsCount } इतिहास प्रविष्टियां सफलतापूर्वक आयात की गई
history_import_file_error = फ़ाइल '{ $fileName }' पढ़ने में त्रुटि: { $errorInfo }

# संदर्भ मेनू
context_menu_translate_full_page = { $lang } में अनुवाद करें
context_menu_translate_selection = { $translator } के साथ { $selection } का अनुवाद करें

# अन्य
share_with_friends = यदि आपको ऐप पसंद है तो अपने दोस्तों के साथ साझा करें
translation_data_failed = डेटा लोड करने में विफल
rate_app_info1 = क्या आप ऐप का उपयोग करके आनंद ले रहे हैं? कृपया हमें 5 सितारे दें!
rate_app_info2 = यह अन्य उपयोगकर्ताओं को एक्सटेंशन ढूंढने और उसके लाभों को फैलाने में मदद करेगा।
rate_app_button = एक्सटेंशन स्टोर में रेट करें
rate_app_button_later = बाद में मुझे याद दिलाएं
deepl_get_own_key_info = www.deepl.com पर पंजीकरण करें और DeepL API के लिए अपनी निःशुल्क प्रमाणीकरण कुंजी प्राप्त करें
deepl_insert_auth_key = DeepL अनुवाद तक पहुँच प्राप्त करने के लिए auth api कुंजी सेट करें
deepl_insert_auth_key_warning = चेतावनी: इस एक्सटेंशन विंडो के अलावा कहीं भी अपनी API कुंजी न दर्ज करें
deepl_insert_auth_key_remove = DeepL API कुंजी हटाएं
target_lang_placeholder = लक्ष्य भाषाएँ
source_lang_placeholder = स्रोत भाषाएँ
favorites_lang_title = पसंदीदा
favorites_info_tooltip = भाषा को पसंदीदा के रूप में चिह्नित/अचिह्नित करने के लिए (सूची ऊपर दिखाई जाती है), { $hotkey } + क्लिक करें
donate_title = डेवलपर्स का समर्थन
donate_copy_wallet = पता कॉपी करें
donate_description = यदि आपको ऐप पसंद है तो डेवलपर्स को दान करने पर विचार करें। धन्यवाद!
service_unavailable = सेवा उपलब्ध नहीं है। 5-25 मिनट बाद पुनः प्रयास करें। यदि यह लगातार होता है तो सेटिंग्स में अनुवाद देरी बढ़ाएं।
service_confirm_not_a_robot = आप { $link } पर भी जा सकते हैं और यह पुष्टि कर सकते हैं कि आप रोबोट नहीं हैं।

# गोपनीयता नीति
privacy_policy_title_updated = गोपनीयता नीति अपडेट हो गई है
privacy_policy_accept_terms = नियम और शर्तें स्वीकार करें

# मेलोटेल एकीकरण
mellowtel_greetings = नमस्ते, मित्र 👋
mellowtel_text1 = जैसा कि आप जानते होंगे, यह एक्सटेंशन सभी के लिए निःशुल्क और उपलब्ध है... लेकिन इस बार इसे जारी रखने के लिए हमें आपकी कुछ कार्रवाई की आवश्यकता है!
mellowtel_text2 = इस नई संस्करण में { $link } ओपन-सोर्स लाइब्रेरी शामिल है। यह लाइब्रेरी आपको अपना अनियोजित इंटरनेट विश्वसनीय AI लैब्स और स्टार्टअप्स के साथ साझा करने की अनुमति देती है जो इसे अपने मॉडल को ट्रेन करने के लिए उपयोग करते हैं।
mellowtel_usage_title = हम मेलोटेल का उपयोग करते हैं:
mellowtel_usage1 = सेवा के आउटेज को ट्रैक करने के लिए
mellowtel_usage2 = सेवा की गुणवत्ता को मापने के लिए
mellowtel_usage3 = इस एक्सटेंशन के डेवलपर के रूप में आय का एक छोटा हिस्सा प्राप्त करने के लिए
mellowtel_accept_all_info1 = यदि आप 'सभी स्वीकार करें' चुनते हैं, तो हम मेलोटेल API का उपयोग यह करने के लिए भी करेंगे: विश्वसनीय पार्टनर्स को आपके नेटवर्क नोड के माध्यम से उनके ट्रैफिक का हिस्सा रूट करते हुए इंटरनेट संसाधनों तक पहुँचने देने के लिए।
mellowtel_accept_all_info2 = मेलोटेल केवल आपका बैंडविड्थ शेयर करता है। सुरक्षा और गोपनीयता 100% गारंटीकृत है और लाइब्रेरी सभी के लिए देखने के लिए ओपन-सोर्स है।
mellowtel_regulation1 = यह व्यक्तिगत जानकारी नहीं एकत्र करता है, साझा नहीं करता है, या बेचता है (यहां तक कि अनामीकृत डेटा भी नहीं)।
mellowtel_regulation2 = यह भी बहुत विनियमित है: मेलोटेल Chrome Web Store नियामकों के साथ संचार बनाए रखता है, एक सुरक्षित अनुभव सुनिश्चित करने के लिए।
mellowtel_regulation3 = यह CWS नियामकों को अनुपालन की निगरानी और प्रवर्तन के लिए उपकरण भी प्रदान करता है।
mellowtel_button_decline = वैकल्पिक उपयोग से इनकार करें
mellowtel_button_accept = सभी स्वीकार करें
mellowtel_dialog_footer = पढ़ने के लिए समय लेने के लिए धन्यवाद, { $devs } टीम।

# विभिन्न त्रुटि संदेश
error_403_auth_failed = प्रमाणीकरण विफल। कृपया सेटिंग्स में एक वैध auth api कुंजी प्रदान करें

# ओपन-एआई एकीकरण
open_ai_get_access_info = 1) platform.openai.com पर पंजीकरण करें 2) api पहुँच कुंजी बनाएँ 3) अपना बैलेंस टॉप-अप करें (5$+)
open_ai_insert_auth_key = OpenAI अनुवाद प्राप्त करने के लिए अपनी api कुंजी प्रदान करें
open_ai_insert_auth_key_warning = चेतावनी: इस एक्सटेंशन विंडो के अलावा कहीं भी अपनी API कुंजी न दर्ज करें
open_ai_insert_auth_key_remove = OpenAI API कुंजी हटाएं
ai_choose_model = AI मॉडल चुनें
ai_choose_model_cost_effective = सबसे लागत-प्रभावी
ai_choose_model_recommended = अनुशंसित मॉडल
ai_choose_model_best_results = सबसे अच्छे परिणाम (सबसे महंगा)

# PDF अनुवाद समर्थन pdf.js के माध्यम से
pdf_use_custom_viewer = PDF फाइलों में अनुवाद समर्थन
pdf_use_custom_viewer_info = यह विकल्प डिफ़ॉल्ट PDF दर्शक को प्रतिस्थापित करेगा

# DeepSeek AI integration (HI)
deepseek_get_own_key_info=platform.deepseek.com पर रजिस्टर करें और बैलेंस रिचार्ज करें (जैसे PayPal के जरिए)
deepseek_auth_key=DeepSeek प्लेटफॉर्म पर API एक्सेस की बनाएं और इसे सेटिंग्स में यहां सहेजें
deepseek_auth_key_warning=चेतावनी: अपना API की केवल इस एक्सटेंशन विंडो में ही दर्ज करें, अन्यत्र नहीं
deepseek_auth_key_remove=DeepSeek API की को हटाएं

# Grok AI integration (HI)
grok_ai_get_own_key_info = console.x.ai पर पंजीकरण करें और बैलेंस टॉप-अप करें (उदाहरण के लिए क्रेडिट कार्ड के माध्यम से)
grok_ai_auth_key = Grok (X) प्लेटफॉर्म पर API-कुंजी बनाएं ताकि API तक पहुंच प्राप्त हो सके
grok_ai_auth_key_warning = चेतावनी: अपनी API कुंजी को इस एक्सटेंशन विंडो के अलावा कहीं और दर्ज न करें
grok_ai_auth_key_remove = Grok API कुंजी हटाएं

